NextFOAM-2501/tutorials/incompressible/adjointOptimisationFoam/topologyOptimisation/monoFluidAero/laminar/1_Inlet_2_Outlet_Dual_Bottleneck/losses-mass-70-30/reEval/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontBack
    {
        type            empty;
    }

    designWall
    {
        type            zeroGradient;
    }

    topOPatch
    {
        type            zeroGradient;
    }

    IEntranceWall  
    {
        type            zeroGradient;
    }

    OEntranceWall  
    {
        type            zeroGradient;
    }

    OREntranceWall  
    {
        type            zeroGradient;
    }

    inlet  
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    
    outlet-right
    {
        type            fixedValue;
        value           uniform 0.0;
    }
}


// ************************************************************************* //
